src/Catalogs/ЧислоПаденийРабочихПроцессов/ЧислоПаденийРабочихПроцессов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЧислоПаденийРабочихПроцессов</name>
  <owners>Catalog.ПоказателиМониторинга</owners>
  <owners>Catalog.ПоказателиОповещений</owners>
  <owners>Catalog.ПоказателиИнцидентов</owners>
  <attributes>
    <name>АвтоМасштаб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВременноеСмещение</name>
    <type>
      <types>EnumRef.ВариантыСмещенияВременногоОкна</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеСерверы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилосьСглаживание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменился</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзменилсяВид</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалУсреднения</name>
    <type>
      <types>EnumRef.ИнтервалыУсреднения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТипаПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьДанныеЗаПрошлыйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТренд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийСервер</name>
    <type>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСглаживания</name>
    <type>
      <types>EnumRef.ТипыСглаживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПадения</name>
    <type>
      <types>EnumRef.ТипыПаденияРабочегоПроцесса</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ИнтервалыУсреднения/ИнтервалыУсреднения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИнтервалыУсреднения</name>
  <enumValues>
    <name>Минута</name>
  </enumValues>
  <enumValues>
    <name>Час</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыПаденияРабочегоПроцесса/ТипыПаденияРабочегоПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПаденияРабочегоПроцесса</name>
  <enumValues>
    <name>СОбразованиемДампа</name>
  </enumValues>
  <enumValues>
    <name>БезОбразованияДампа</name>
  </enumValues>
  <enumValues>
    <name>СОбразованиемИБезОбразованияДампа</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ЧислоПаденийРабочихПроцессов/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Выборка = Общий.ВыборкаРабочихСерверов();
	ПервыйКластер = Истина;
	Пока Выборка.Следующий() Цикл
		
		РабочийСервер = Выборка.Ссылка;
		Элементы.РабочийСервер.СписокВыбора.Добавить(РабочийСервер);
		
	КонецЦикла;
	
	Если Объект.Ссылка.Пустая() И Элементы.РабочийСервер.СписокВыбора.Количество() > 0 Тогда
		
		РабочийСервер = Элементы.РабочийСервер.СписокВыбора[0].Значение;
		Объект.РабочийСервер = РабочийСервер;
		
		Объект.ИнтервалУсреднения = Перечисления.ИнтервалыУсреднения.Час;
		Объект.ВсеСерверы = Истина;
		Объект.ТипПадения = Перечисления.ТипыПаденияРабочегоПроцесса.СОбразованиемИБезОбразованияДампа;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастроитьВидимостьРабочихСерверов();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрОповещения = МониторингСервер.ПараметрОповещенияПоказательЗаписан(ТекущийОбъект);
	ПараметрОповещения.Изменился = ОбъектИзменился();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрОповещения.Ссылка = Объект.Ссылка;
	ПараметрОповещения.Описание = Объект.Описание;
	Оповестить("ПоказательЗаписан", ПараметрОповещения, ЭтотОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВсеСерверыПриИзменении(Элемент)
	НастроитьВидимостьРабочихСерверов();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура НастроитьВидимостьРабочихСерверов()
	Элементы.РабочийСервер.Видимость = НЕ Объект.ВсеСерверы;
КонецПроцедуры

&НаСервере
Функция ОбъектИзменился()
	
	Если Объект.ВсеСерверы <> Объект.Ссылка.ВсеСерверы Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ Объект.ВсеСерверы И Объект.РабочийСервер <> Объект.Ссылка.РабочийСервер Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Объект.ИнтервалУсреднения <> Объект.Ссылка.ИнтервалУсреднения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Объект.ТипПадения <> Объект.Ссылка.ТипПадения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
